---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AnalyticalPhysicalCheckDone
source: html/b1b50831-0efb-a621-c8cb-0fad54a9de53.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AnalyticalPhysicalCheckDone Property

Analytical / Physical Model Consistency check is complete.

## Syntax (C#)
```csharp
public static FailureDefinitionId AnalyticalPhysicalCheckDone { get; }
```